# MAT281 - Laboratorio N°03

## Problema 01


<img src="https://imagenes.universia.net/gc/net/images/practicas-empleo/p/pr/pro/profesiones-con-el-avance-de-la-tecnologia.jpg" width="480" height="360" align="center"/>


EL conjunto de datos se denomina `ocupation.csv`, el cual contiene información de distintos usuarios (edad ,sexo, profesión, etc.).

Lo primero es cargar el conjunto de datos y ver las primeras filas que lo componen:

In [1]:
import pandas as pd
import os

In [2]:
# cargar datos
df = pd.read_csv(os.path.join("data","ocupation.csv"), sep="|")
df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

El objetivo es tratar de obtener la mayor información posible de este conjunto de datos. Para cumplir este objetivo debe resolver las siguientes problemáticas:

1.- ¿Cuál es el número de observaciones en el conjunto de datos?

In [3]:
print("Numero de observaciones:", df.shape[0])

Numero de observaciones: 943

2.- ¿Cuál es el número de columnas en el conjunto de datos?

In [4]:
print("Numero de columnas:", df.shape[1])

Numero de columnas: 5

3.- Imprime el nombre de todas las columnas

In [5]:
print("las columnas son:")
for col in df.columns:
    print(col)

las columnas son:
user_id
age
gender
occupation
zip_code

4.- Imprima el índice del dataframe

In [6]:
print(df.index)

RangeIndex(start=0, stop=943, step=1)

5.- ¿Cuál es el tipo de datos de cada columna?

In [7]:
df.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

6.- Describir el conjunto de datos (**hint**: .describe())

In [8]:
df.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

7.- Imprimir solo la columna de **occupation**.

In [9]:
print(df["occupation"])

0         technician
1              other
2             writer
3         technician
4              other
           ...
938          student
939    administrator
940          student
941        librarian
942          student
Name: occupation, Length: 943, dtype: object

8.- ¿Cuántas ocupaciones diferentes hay en este conjunto de datos?

In [10]:

print("hay un total de", len(df["occupation"].unique()), "ocupaciones")

hay un total de 21 ocupaciones

9.- ¿Cuál es la ocupación más frecuente?

In [11]:
print("La ocupación más frecuente es:", df["occupation"].value_counts().idxmax())

La ocupación más frecuente es: student

In [12]:
print("con una frecuencia de:", df["occupation"].value_counts().max())

con una frecuencia de: 196

10.- ¿Cuál es la edad media de los usuarios?

In [13]:
print("La edad promedio es", df["age"].mean())

La edad promedio es 34.05196182396607

In [14]:
print("redondeada:", round(df["age"].mean()))

redondeada: 34

11.- ¿Cuál es la edad con menos ocurrencia?

In [15]:
print("la edad con menos ocurrencia es:", df["age"].value_counts().idxmin())

la edad con menos ocurrencia es: 7

In [16]:
df.groupby(["occupation"])["age"].mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

12.- Encontrar la edad promedio según la variable **occupation**

## Problema 02


<img src="https://image.freepik.com/vector-gratis/varios-automoviles-dibujos-animados_23-2147613095.jpg" width="360" height="360" align="center"/>


EL conjunto de datos se denomina `Automobile_data.csv`, el cual contiene información tal como: compañia, precio, kilometraje, etc.

Lo primero es cargar el conjunto de datos y ver las primeras filas que lo componen:

In [17]:
# cargar datos
df = pd.read_csv(os.path.join("data","Automobile_data.csv")).set_index('index')
df.head()

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
index,,,,,,,,,
0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

El objetivo es tratar de obtener la mayor información posible de este conjunto de datos. Para cumplir este objetivo debe resolver las siguientes problemáticas:

1. Elimine los valores nulos (Nan)

In [18]:
df=df.dropna()

2. Encuentra el nombre de la compañía de automóviles más cara

In [19]:
df.groupby(["company"]).mean()["price"].idxmax()

'porsche'

3. Imprimir todos los detalles de Toyota Cars

In [20]:
df.where(df["company"]=="toyota").dropna()

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
index,,,,,,,,,
66,toyota,hatchback,95.7,158.7,ohc,four,62.0,35.0,5348.0
67,toyota,hatchback,95.7,158.7,ohc,four,62.0,31.0,6338.0
68,toyota,hatchback,95.7,158.7,ohc,four,62.0,31.0,6488.0
69,toyota,wagon,95.7,169.7,ohc,four,62.0,31.0,6918.0
70,toyota,wagon,95.7,169.7,ohc,four,62.0,27.0,7898.0
71,toyota,wagon,95.7,169.7,ohc,four,62.0,27.0,8778.0
79,toyota,wagon,104.5,187.8,dohc,six,156.0,19.0,15750.0

4. Cuente el total de automóviles por compañía

In [21]:
df.groupby(["company"])["company"].count()

company
alfa-romero      3
audi             4
bmw              6
chevrolet        3
dodge            2
honda            3
isuzu            1
jaguar           3
mazda            5
mercedes-benz    4
mitsubishi       4
nissan           5
porsche          2
toyota           7
volkswagen       4
volvo            2
Name: company, dtype: int64

5. Encuentra el coche con el precio más alto por compañía

In [22]:
df.groupby(["company"])["price"].idxmax()

company
alfa-romero       1
audi              6
bmw              14
chevrolet        18
dodge            19
honda            28
isuzu            30
jaguar           35
mazda            43
mercedes-benz    47
mitsubishi       52
nissan           57
porsche          62
toyota           79
volkswagen       86
volvo            88
Name: price, dtype: int64

6. Encuentre el kilometraje promedio (**average-mileage**) de cada compañía automotriz

In [23]:
df.groupby(["company"])["average-mileage"].mean()

company
alfa-romero      20.333333
audi             20.000000
bmw              19.000000
chevrolet        41.000000
dodge            31.000000
honda            26.333333
isuzu            24.000000
jaguar           14.333333
mazda            28.000000
mercedes-benz    18.000000
mitsubishi       29.500000
nissan           31.400000
porsche          17.000000
toyota           28.714286
volkswagen       31.750000
volvo            23.000000
Name: average-mileage, dtype: float64

7. Ordenar todos los autos por columna de precio (**price**)

In [24]:
df["price"].sort_values()

index
16     5151.0
36     5195.0
66     5348.0
49     5389.0
37     6095.0
50     6189.0
20     6229.0
17     6295.0
67     6338.0
19     6377.0
68     6488.0
18     6575.0
54     6649.0
30     6785.0
38     6795.0
55     6849.0
69     6918.0
51     6989.0
53     7099.0
27     7295.0
56     7349.0
80     7775.0
70     7898.0
81     7975.0
82     7995.0
52     8189.0
71     8778.0
86     9995.0
29    10345.0
39    11845.0
87    12940.0
28    12945.0
88    13415.0
0     13495.0
57    13499.0
3     13950.0
5     15250.0
79    15750.0
9     16430.0
1     16500.0
2     16500.0
10    16925.0
4     17450.0
43    18344.0
6     18920.0
11    20970.0
44    25552.0
45    28248.0
13    30760.0
33    32250.0
61    34028.0
34    35550.0
35    36000.0
15    36880.0
62    37028.0
46    40960.0
14    41315.0
47    45400.0
Name: price, dtype: float64

## Problema 03


Siguiendo la temática de los automóviles, resuelva los siguientes problemas:

### a) Subproblema 01
A partir de los siguientes diccionarios:

In [25]:
GermanCars = {'Company': ['Ford', 'Mercedes', 'BMV', 'Audi'],
              'Price': [23845, 171995, 135925 , 71400]}
japaneseCars = {'Company': ['Toyota', 'Honda', 'Nissan', 'Mitsubishi '], 
                'Price': [29995, 23600, 61500 , 58900]}

* Cree dos dataframes (**carsDf1** y **carsDf2**) según corresponda.
* Concatene ambos dataframes (**carsDf**) y añada una llave ["Germany", "Japan"], según corresponda.

In [26]:
carsDf1=pd.DataFrame(GermanCars)
carsDf2=pd.DataFrame(japaneseCars)
carsDf=pd.concat([carsDf1,carsDf2],keys=["Germany","Japan"])

### b) Subproblema 02

A partir de los siguientes diccionarios:

In [27]:
Car_Price = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'Price': [23845, 17995, 135925 , 71400]}
car_Horsepower = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'horsepower': [141, 80, 182 , 160]}

* Cree dos dataframes (**carsDf1** y **carsDf2**) según corresponda.
*  Junte ambos dataframes (**carsDf**) por la llave **Company**.

In [28]:
carsDf1=pd.DataFrame(Car_Price)
carsDf2=pd.DataFrame(car_Horsepower)
carsDf=carsDf1.join(carsDf2.set_index("Company"),on="Company")

In [29]:
carsDf

  Company   Price  horsepower
0  Toyota   23845         141
1   Honda   17995          80
2     BMV  135925         182
3    Audi   71400         160